package com.iexiao.pnsp.base.constants;

public class Constant {
	
	/** **时间格式**************************************************************************************************** */
	/*yyyy-MM-dd*/
	public static final String DATE_YMD = "yyyy-MM-dd";
	
	/*hh-mm-ss*/
	public static final String DATE_HMS = "hh-mm-ss";
	
	/*yyyy-MM-dd hh-mm-ss*/
	public static final String DATE_YMD_HMS = "yyyy-MM-dd hh-mm-ss";
	
	/** **正则表达式**************************************************************************************************** */
	/*手机号正则表达式(13/15/18开头,可拓展)*/
	public static final String REG_CELLPHONE = "^((13[0-9])|(14[5|7])|(15([0-3]|[5-9]))|(18[0,5-9]))\\d{8}$"; 
	
	/*字符串仅能是中文*/
	public static final String REG_CHINESE = "^[\\\\u4e00-\\\\u9fa5]{0,}$";
	
	/*校验E-Mail地址*/
	public static final String REG_EMAIL = "[\\\\w!#$%&'*+/=?^_`{|}~-]+(?:\\\\.[\\\\w!#$%&'*+/=?^_`{|}~-]+)*@(?:[\\\\w](?:[\\\\w-]*[\\\\w])?\\\\.)+[\\\\w](?:[\\\\w-]*[\\\\w])?";
	
	/*身份证号码15位*/
	public static final String REG_ID_CARD_15 = "^[1-9]\\\\d{7}((0\\\\d)|(1[0-2]))(([0|1|2]\\\\d)|3[0-1])\\\\d{3}$";
	
	/*身份证号码18位*/
	public static final String REG_ID_CARD_18 = "^[1-9]\\\\d{5}[1-9]\\\\d{3}((0\\\\d)|(1[0-2]))(([0|1|2]\\\\d)|3[0-1])\\\\d{3}([0-9]|X)$";
	
	/*考虑平闰年且格式为'yyyy-MM-dd '的日期*/
	public static final String REG_DATE_YMD = "^(?:(?!0000)[0-9]{4}-(?:(?:0[1-9]|1[0-2])-(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])-(?:29|30)|(?:0[13578]|1[02])-31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)-02-29)$";
	
	/*金额,精确到2位小数*/
	public static final String REG_AMOUNT = "^[0-9]+(.[0-9]{2})?$";
	
	/*邮政编码*/
	public static final String REG_ZIP = "^[0-9]\\d{5}$";
	
	/*QQ号码*/
	public static final String REG_QQ = "^[1-9]\\d{4,10}$";
	
	/*整数*/
	public static final String REG_INT = "^[+]?[0-9]\\d*$";
	
	/*IE的版本*/
	public static final String REG_IE = "^.*MSIE[5-8](?:\\\\.[0-9]+)?(?!.*Trident\\\\/[5-9]\\\\.0).*$";
	
	/*校验IP-v4地址*/
	public static final String REG_IP_V4 = "\\\\b(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\\\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\\\b";
	
	/*校验IP-v6地址*/
	public static final String REG_IP_V6 = "(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\\\\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\\\\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9]))";
	
	/*windows下文件路径及扩展名*/
	public static final String REG_WIN_FILE_PATH_TXT = "^([a-zA-Z]\\\\:|\\\\\\\\)\\\\\\\\([^\\\\\\\\]+\\\\\\\\)*[^\\\\/:*?\"<>|]+\\\\.txt(l)?$";

	

	
}
